strashno-georgiev/serial-protocol/FS/Setup/STM32F769_ST_STM32F769I_Discovery/FS_MMC_HW_CM_STM32F769_ST_STM32F769I_DISCO.c
  if (NumBytes) {
    //
    // Align the address and the number of bytes to a cache line.
    //
    AddrBegin = (U32)p;
    AddrEnd   = AddrBegin + NumBytes;
    AddrBegin = _RoundDownToCacheLine(AddrBegin);
    AddrEnd   = _RoundUpToCacheLine(AddrEnd);
    NumBytes  = AddrEnd - AddrBegin;
    SCB_InvalidateDCache_by_Addr((unsigned int *)AddrBegin, (int)NumBytes);
  }
}

/*********************************************************************
*
*       _CleanDCache
*
*  Function description
*    Cleans the lines of the data cache
*    which store a specified memory range.
*/
static void _CleanDCache(U32 * p, U32 NumBytes) {
  U32 AddrBegin;
  U32 AddrEnd;

  if (NumBytes) {
    //
    // Align the address and the number of bytes to a cache line.
    //
    AddrBegin = (U32)p;
    AddrEnd   = AddrBegin + NumBytes;
    AddrBegin = _RoundDownToCacheLine(AddrBegin);
    AddrEnd   = _RoundUpToCacheLine(AddrEnd);
    NumBytes  = AddrEnd - AddrBegin;
    SCB_CleanDCache_by_Addr((unsigned int *)AddrBegin, (int)NumBytes);
  }
}

/*********************************************************************
*
*       _IsDataCached
*/
static int _IsDataCached(U32 * pData) {
  int r;

  //
  // Add addresses above 0x20010000 are accessed via L1 cache of the CPU.
  //
  r = 0;
  if (_IsDCacheEnabled() && ((U32)pData >= 0x20010000)) {
    r = 1;
  }
  return r;
}

/*********************************************************************
*
*       _StartDMARead
*/
static void _StartDMARead(U32 * pData, U32 NumBytes) {
  if (_IsDataCached(pData)) {
    //
    // Make sure that the data is consistent by cleaning the caches.
    //
    _CleanDCache(pData, NumBytes);
  }
  _StartDMATransfer(pData, (U32 *)&SDMMC_FIFO, PERIPHERAL_TO_MEMORY);
}

/*********************************************************************
*
*       _StartDMAWrite
*/
static void _StartDMAWrite(U32 * pData, U32 NumBytes) {
  if (_IsDataCached(pData)) {
    //
    // Make sure that the data is consistent by cleaning the caches.
    //
    _CleanDCache(pData, NumBytes);
  }
  _StartDMATransfer(pData, (U32 *)&SDMMC_FIFO, MEMORY_TO_PERIPHERAL);
}

/*********************************************************************
*
*       _WaitForEndOfDMARead
*
*  Function description
*    Waits until the current DMA read operation finishes.
*/
static int _WaitForEndOfDMARead(void) {
  int r;
  U32 StatusSDIO;
  U32 StatusDMA;
#if (FS_MMC_HW_CM_USE_OS == 0)
  U32 TimeOut;
#endif // FS_MMC_HW_CM_USE_OS == 0

#if (FS_MMC_HW_CM_USE_OS == 0)
  TimeOut = WAIT_TIMEOUT_CYCLES;
#endif
  r = FS_MMC_CARD_READ_TIMEOUT;
  for (;;) {
#if FS_MMC_HW_CM_USE_OS
    StatusSDIO = _StatusSDIO;
    StatusDMA  = _StatusDMA;
#else
    StatusSDIO = SDMMC_STA;
    StatusDMA  = DMA2_LISR;
#endif
    if (StatusDMA & LISR_TEIF0) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DCRCFAIL) {
      r = FS_MMC_CARD_READ_CRC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DTIMEOUT) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;
    }
    if (StatusSDIO & STA_RXOVERR) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_STBITERR) {
      r = FS_MMC_CARD_READ_GENERIC_ERROR;
      break;
    }
    if (StatusDMA & LISR_TCIF0) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
#if FS_MMC_HW_CM_USE_OS
    r = FS_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      r = FS_MMC_CARD_READ_TIMEOUT;
      break;
    }
#else
    if (TimeOut-- == 0u) {
      r = FS_MMC_CARD_RESPONSE_TIMEOUT;        // Error, no data received.
      break;
    }
#endif // FS_MMC_HW_CM_USE_OS
  }
  //
  // In case of an error, disable DMA and the data state machine in SDMMC.
  //
  if (r != 0) {
    DMA2_S0CR &= ~S0CR_EN;            // Stop the data transfer
    while (DMA2_S0CR & S0CR_EN) {     // Wait for the stream to switch off
      ;
    }
    SDMMC_DCTRL &= ~DCTRL_DTEN;        // Cancel SDMMC data transfer.
  }
  return r;
}

/*********************************************************************
*
*       _WaitForEndOfDMARead
*
*  Function description
*    Waits until the current DMA write operation finishes.
*/
static int _WaitForEndOfDMAWrite(void) {
  int r;
  U32 StatusSDIO;
  U32 StatusDMA;
#if (FS_MMC_HW_CM_USE_OS == 0)
  U32 TimeOut;
#endif // FS_MMC_HW_CM_USE_OS == 0

#if (FS_MMC_HW_CM_USE_OS == 0)
  TimeOut = WAIT_TIMEOUT_CYCLES;
#endif
  r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
  //
  // Data transfer starts as soon as the Data Control Register of SDIO is updated.
  //
  SDMMC_DCTRL = 0
             | _DataBlockSize
             | DCTRL_DTEN
             | DCTRL_DMAEN
             ;
  for (;;) {
#if FS_MMC_HW_CM_USE_OS
    StatusSDIO = _StatusSDIO;
    StatusDMA  = _StatusDMA;
#else
    StatusSDIO = SDMMC_STA;
    StatusDMA  = DMA2_LISR;
#endif
    if (StatusDMA & LISR_TEIF0) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DCRCFAIL) {
      r = FS_MMC_CARD_WRITE_CRC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DTIMEOUT) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_TXUNDERR) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_STBITERR) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
    if (StatusSDIO & STA_DATAEND) {
      r = FS_MMC_CARD_NO_ERROR;
      break;
    }
#if FS_MMC_HW_CM_USE_OS
    r = FS_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      r = FS_MMC_CARD_WRITE_GENERIC_ERROR;
      break;
    }
#else
    if (TimeOut-- == 0u) {
      r = FS_MMC_CARD_RESPONSE_TIMEOUT;       // Error, no data received.
      break;
    }
#endif
  }
  //
  // In case of an error, disable DMA and the data state machine in SDMMC.
  //
  if (r != 0) {
    DMA2_S0CR &= ~S0CR_EN;            // Stop the data transfer
    while (DMA2_S0CR & S0CR_EN) {     // Wait for the stream to switch off
      ;
    }
    SDMMC_DCTRL &= ~DCTRL_DTEN;        // Cancel SDMMC data transfer.
  }
  return r;
}

/*********************************************************************
*
*       _ProcessDMARead
*
*  Function description
*   Invalidates the data cache of the specified buffer by preserving
*   of the bytes located before and after the buffer when the buffer
*   is not cache aligned. The unaligned bytes are copied via DMA
*   to an internal cache-aligned buffer which is then invalidated.
*   At the end the data is copied via CPU from the internal cache-aligned
*   buffer to the original location in the specified buffer.
*/
static void _ProcessDMARead(U32 * pData, U32 NumBytes) {
  U8  * pData8;
  U32   NumBytesAtOnce;

  if (_IsDataCached(pData)) {
    //
    // Invalidate unaligned leading bytes.
    //
    pData8 = (U8 *)pData;
    NumBytesAtOnce = (U32)pData8 & (CACHE_LINE_SIZE - 1);
    if (NumBytesAtOnce) {
      NumBytesAtOnce = CACHE_LINE_SIZE - NumBytesAtOnce;
      NumBytesAtOnce = SEGGER_MIN(NumBytesAtOnce, NumBytes);
      _CopyDataWithDMA(_pCacheBuffer, (U32 *)(void *)pData8, NumBytesAtOnce);
      _InvalidateDCache(_pCacheBuffer, NumBytesAtOnce);
      FS_MEMCPY(pData8, _pCacheBuffer, NumBytesAtOnce);
      NumBytes -= NumBytesAtOnce;
      pData8   += NumBytesAtOnce;
    }
    //
    // Invalidate aligned bytes.
    //
    if (NumBytes) {
      NumBytesAtOnce = NumBytes & ~(CACHE_LINE_SIZE - 1);
      if (NumBytesAtOnce) {
        _InvalidateDCache((U32 *)(void *)pData8, NumBytesAtOnce);
        NumBytes -= NumBytesAtOnce;
        pData8   += NumBytesAtOnce;
      }
    }
    //
    // Invalidate unaligned trailing bytes.
    //
    if (NumBytes) {
      _CopyDataWithDMA(_pCacheBuffer, (U32 *)(void *)pData8, NumBytes);
      _InvalidateDCache(_pCacheBuffer, NumBytes);
      FS_MEMCPY(pData8, _pCacheBuffer, NumBytes);
    }
  }
}

/*********************************************************************
*
*       _WriteRegDelayed
*
*  Function description
*    Waits before writing to a register as specified in the datasheet:
*      "After a data write, data cannot be written to this register for three SDIOCLK
*      (48 MHz) clock periods plus two FS_MMC_HW_CM_PCLK2 clock periods."
*/
static void _WriteRegDelayed(volatile U32 * pAddr, U32 Value) {
  volatile U32 NumLoops;

  NumLoops  = _NumLoopsWriteRegDelay;
  do {
    ;
  } while (--NumLoops);
  *pAddr = Value;
}

/*********************************************************************
*
*       _WaitForInactive
*/
static void _WaitForInactive(void) {
  U32 Status;
  U32 v;
  U32 TimeOut;

