strashno-georgiev/serial-protocol/FS/Setup/STM32F769_ST_STM32F769I_Discovery/FS_MMC_HW_CM_STM32F769_ST_STM32F769I_DISCO.c
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = SDMMC_STA;
    if (((Status & STA_CMDACT) == 0) &&
        ((Status & STA_TXACT)  == 0) &&
        ((Status & STA_RXACT)  == 0)) {
      if (_IsR1Busy == 0) {
        break;
      }
      //
      // The SDMMC host controller is not able to handle R1 responses
      // with busy signaling therefore we have to check here the
      // level of the DAT0 line. The SD / MMC device drives the DAT0
      // line to LOW if busy.
      // The SD / MMC devices require to be clocked in order to release
      // the DAT0 line but the SDMMC host controller is configured clock
      // the SD/ MMC device only when a command or data is transferred
      // (to prevent DMA issues). For this reason we have to temporarily
      // disable this mode so that the SDMMC host controller
      // clocks the SD / MMC device while we are checking the status
      // of the DAT0 line.
      //
      if (GPIOG_IDR & (1uL << SD_D0_BIT)) {
        _IsR1Busy = 0;
        if ((SDMMC_CLKCR & CLKCR_CLK_PWRSAV) == 0) {
          v = SDMMC_CLKCR | CLKCR_CLK_PWRSAV;
          _WriteRegDelayed(&SDMMC_CLKCR, v);
        }
        break;
      }
      if (SDMMC_CLKCR & CLKCR_CLK_PWRSAV) {
        v = SDMMC_CLKCR & ~CLKCR_CLK_PWRSAV;
        _WriteRegDelayed(&SDMMC_CLKCR, v);
      }
    }
    if (--TimeOut == 0) {
      break;                            // Error, timeout expired.
    }
  }
}

/*********************************************************************
*
*       Static code (public via callback)
*
**********************************************************************
*/

/*********************************************************************
*
*       _HW_SetHWNumBlocks
*
*  Function description
*    Sets the number of block (sectors) to be transferred.
*/
static void _HW_SetHWNumBlocks(U8 Unit, U16 NumBlocks) {
  FS_USE_PARA(Unit);
  _NumBlocks = NumBlocks;
}

/*********************************************************************
*
*       _HW_SetHWBlockLen
*
*  Function description
*    Sets the block size (sector size) that shall be transferred.
*/
static void _HW_SetHWBlockLen(U8 Unit, U16 BlockSize) {
  FS_USE_PARA(Unit);
  _BlockSize     = BlockSize;
  _DataBlockSize = _ld(BlockSize) << DCTRL_DBLOCKSIZE_SHIFT;
}

/*********************************************************************
*
*       _HW_SetMaxSpeed
*
*  Function description
*    Sets the frequency of the MMC/SD card controller.
*    The frequency is given in kHz.
*    It is called 2 times:
*     1. During card initialization
*        Initialize the frequency to not more than 400kHz.
*
*     2. After card initialization
*        The CSD register of card is read and the max frequency
*        the card can operate is determined.
*        [In most cases: MMC cards 20MHz, SD cards 25MHz]
*/
static U16 _HW_SetMaxSpeed(U8 Unit, U16 Freq) {
  U32      Fact;
  unsigned Div;
  U32      ClkBypass;
  U32      v;

  FS_USE_PARA(Unit);
  if (Freq > FS_MMC_HW_CM_MAX_SD_CLK_KHZ) {
    Freq = FS_MMC_HW_CM_MAX_SD_CLK_KHZ;
  }
  _WaitForInactive();
  SDMMC_CLKCR &= ~(CLKCR_CLKEN | 0xFFuL | CLKCR_CLK_BYPASS);
  Fact        = 2;
  Div         = 0;
  ClkBypass   = CLKCR_CLK_BYPASS;
  if (Freq < FS_MMC_HW_CM_SDMMC_CLK_KHZ) {
    ClkBypass = 0;
    while ((Freq * Fact) < FS_MMC_HW_CM_SDMMC_CLK_KHZ) {
      ++Fact;
      if (0xFF == ++Div) {
        break;
      }
    }
  }
  v = 0
    | SDMMC_CLKCR
    | Div
    | CLKCR_CLKEN
    | CLKCR_CLK_PWRSAV
    | CLKCR_HWFC_EN         // Enable flow control to prevent over-/underflow errors in the data transfer.
    | ClkBypass
    ;
  _WriteRegDelayed(&SDMMC_CLKCR, v);
  Freq = FS_MMC_HW_CM_SDMMC_CLK_KHZ;
  if (ClkBypass == 0) {
    Freq = FS_MMC_HW_CM_SDMMC_CLK_KHZ / (Div + 2);
  }
  return Freq;
}

/*********************************************************************
*
*       _HW_IsPresent
*
*  Function description
*    Returns the state of the media. If you do not know the state, return
*    FS_MEDIA_STATE_UNKNOWN and the higher layer will try to figure out if
*    a media is present.
*
*  Return value
*    FS_MEDIA_STATE_UNKNOWN   The state of the media is unknown
*    FS_MEDIA_NOT_PRESENT     No card is present
*    FS_MEDIA_IS_PRESENT      A card is present
*/
static int _HW_IsPresent(U8 Unit) {
  int Status;

  FS_USE_PARA(Unit);
  Status = FS_MEDIA_IS_PRESENT;
  if ((GPIOI_IDR & 1uL << SD_CD_BIT)) {
    Status = FS_MEDIA_NOT_PRESENT;
  }
  return Status;
}

/*********************************************************************
*
*       _HW_IsWriteProtected
*
*  Function description
*    Returns whether card is write protected or not.
*/
static int _HW_IsWriteProtected(U8 Unit) {
  FS_USE_PARA(Unit);
  return 0;
}

/*********************************************************************
*
*       _HW_SetResponseTimeOut
*
*  Function description
*    Sets the response time out value given in MMC/SD card cycles.
*/
static void _HW_SetResponseTimeOut(U8 Unit, U32 Value) {
  FS_USE_PARA(Unit);
  FS_USE_PARA(Value);
  //
  // The response timeout is fixed in hardware
  //
}

/*********************************************************************
*
*       _HW_SetReadDataTimeOut
*
*  Function description
*    Sets the read data time out value given in MMC/SD card cycles.
*/
static void _HW_SetReadDataTimeOut(U8 Unit, U32 Value) {
  FS_USE_PARA(Unit);
  SDMMC_DTIMER = Value;
}

/*********************************************************************
*
*       _HW_SendCmd
*
*  Function description
*    Sends a command to the MMC/SD card.
*/
static void _HW_SendCmd(U8 Unit, unsigned Cmd, unsigned CmdFlags, unsigned ResponseType, U32 Arg) {
  U32 CmdCfg;
  U32 NumBytes;
  U32 Status;
  U32 v;
#if (FS_MMC_HW_CM_USE_OS == 0)
  U32 TimeOut;
#endif // FS_MMC_HW_CM_USE_OS == 0

  FS_USE_PARA(Unit);
  _WaitForInactive();
  _RepeatSame = 0;
  if (CmdFlags & FS_MMC_CMD_FLAG_WRITE_BURST_FILL) {
    _RepeatSame = 1;
  }
  _IsR1Busy = 0;
  if (CmdFlags & FS_MMC_CMD_FLAG_SETBUSY) {
    _IsR1Busy = 1;
  }
  CmdCfg = CMD_CPSMEN
         | CMD_ENDCMDCMPLT
         | CMD_NIEN
         ;
  _IgnoreCRC = 0;
  switch (ResponseType) {
  case FS_MMC_RESPONSE_FORMAT_R3:
    _IgnoreCRC = 1;
    //lint -fallthrough
  default:
    //lint -fallthrough
  case FS_MMC_RESPONSE_FORMAT_R1:
    CmdCfg |= CMD_WAITRESP_SHORT;
    break;
  case FS_MMC_RESPONSE_FORMAT_R2:
    CmdCfg |= CMD_WAITRESP_LONG;
    break;
  }
  v  = SDMMC_CLKCR;
  v &= ~CLKCR_WIDBUS_MASK;
  if (CmdFlags & FS_MMC_CMD_FLAG_USE_SD4MODE) {   // 4 bit mode?
    v |= CLKCR_WIDBUS_4BIT;
  } else {
    v &=~CLKCR_WIDBUS_MASK;
  }
  SDMMC_CLKCR = v;
  v = 0;
  if (CmdFlags & FS_MMC_CMD_FLAG_DATATRANSFER) {
    SDMMC_ICR = ICR_DCRCFAIL
             | ICR_DTIMEOUT
             | ICR_TXUNDERR
             | ICR_DATAEND
             | ICR_DBCKEND
             | ICR_STBITERR
             | ICR_RXOVERR
             ;
    NumBytes = _BlockSize * _NumBlocks;
    SDMMC_DLEN = NumBytes;
    if ((CmdFlags & FS_MMC_CMD_FLAG_WRITETRANSFER) == 0) {
      //
      // Start the read operation via DMA.
      //
      _StartDMARead(_pBuffer, NumBytes);
      //
      // Data transfer starts when the data control register is updated.
      //
      v = 0
        | _DataBlockSize
        | DCTRL_DTDIR
        | DCTRL_DMAEN
        | DCTRL_DTEN
        ;
    } else {
      //
      // Start the write operation via DMA.
      //
      _StartDMAWrite(_pBuffer, NumBytes);
    }
  }
  SDMMC_DCTRL = v;
  //
  // Clear pending status flags
  //
  SDMMC_ICR = ICR_CCRCFAIL
           | ICR_CTIMEOUT
           | ICR_CMDREND
           | ICR_CMDSENT
           ;
#if FS_MMC_HW_CM_USE_OS
  _StatusSDIO = 0;
#else
  TimeOut = WAIT_TIMEOUT_CYCLES;
#endif
  SDMMC_ARG = Arg;
  SDMMC_CMD = CmdCfg | (Cmd & CMD_CMD_MASK);
  if (CmdFlags & FS_MMC_CMD_FLAG_INITIALIZE)  {
    while (1) {
#if FS_MMC_HW_CM_USE_OS
      Status = _StatusSDIO;
#else
      Status = SDMMC_STA;
#endif
      if (Status & (STA_CMDSENT | STA_CMDREND | STA_CCRCFAIL |  STA_CTIMEOUT)) {
        break;
      }
#if FS_MMC_HW_CM_USE_OS
      {
        int r;

