strashno-georgiev/serial-protocol/FS/Setup/STM32F769_ST_STM32F769I_Discovery/FS_MMC_HW_CM_STM32F769_ST_STM32F769I_DISCO.c
        r = FS_OS_Wait(WAIT_TIMEOUT_MS);
        if (r != 0) {
          break;
        }
      }
#else
      if (--TimeOut == 0) {
        break;
      }
#endif
    }
  }
}

/*********************************************************************
*
*       _HW_GetResponse
*
*  Function description
*    Receives the responses that was sent by the card after
*    a command was sent to the card.
*/
static int _HW_GetResponse(U8 Unit, void *pBuffer, U32 Size) {
  U8           * p;
  U32            NumBytes;
  volatile U32 * pReg;
  U32            Data32;
  U32            Status;
  U32            NumWords;
#if (FS_MMC_HW_CM_USE_OS == 0)
  U32            TimeOut;
#endif // FS_MMC_HW_CM_USE_OS == 0

  FS_USE_PARA(Unit);
  p        = (U8 *)pBuffer;
  NumBytes = Size;
#if (FS_MMC_HW_CM_USE_OS == 0)
  TimeOut  = WAIT_TIMEOUT_CYCLES;
#endif // FS_MMC_HW_CM_USE_OS == 0
  for (;;) {
#if FS_MMC_HW_CM_USE_OS
    Status = _StatusSDIO;
#else
    Status = SDMMC_STA;
#endif
    if (Status & (STA_CMDSENT | STA_CMDREND | STA_CCRCFAIL | STA_CTIMEOUT)) {
      break;
    }
#if FS_MMC_HW_CM_USE_OS
    {
      int r;

      r = FS_OS_Wait(WAIT_TIMEOUT_MS);
      if (r != 0) {
        return FS_MMC_CARD_RESPONSE_TIMEOUT;
      }
    }
#else
    if (--TimeOut == 0) {
      return FS_MMC_CARD_RESPONSE_TIMEOUT;
    }
#endif
  }
  if (STA_CTIMEOUT & Status) {
    return FS_MMC_CARD_RESPONSE_TIMEOUT;
  }
  if ((STA_CCRCFAIL & Status) && !_IgnoreCRC) {
    return FS_MMC_CARD_READ_CRC_ERROR;
  }
  if ((STA_CMDREND & Status) || _IgnoreCRC) {
    *p++ = (U8)SDMMC_RESPCMD;
    NumBytes--;
    pReg = (volatile U32 *)(&SDMMC_RESP1);
    NumWords = NumBytes >> 2;
    if (NumWords) {
      do {
        Data32 = *pReg++;
        *p++ = (U8)(Data32 >> 24);
        *p++ = (U8)(Data32 >> 16);
        *p++ = (U8)(Data32 >> 8);
        *p++ = (U8)Data32;
        NumBytes -= 4;
      } while (--NumWords);
    }
    if (NumBytes == 3) {
      Data32 = *pReg;
      *p++ = (U8)(Data32 >> 24);
      *p++ = (U8)(Data32 >> 16);
      *p++ = (U8)(Data32 >> 8);
    }
    if (NumBytes == 2) {
      Data32 = *pReg;
      *p++ = (U8)(Data32 >> 24);
      *p++ = (U8)(Data32 >> 16);
    }
    if (NumBytes == 1) {
      Data32 = *pReg;
      *p++ = (U8)(Data32 >> 24);
    }
  }
  return FS_MMC_CARD_NO_ERROR;
}

/*********************************************************************
*
*       _HW_ReadData
*
*  Function description
*    Reads data from MMC/SD card through the MMC/SD card controller.
*/
static int _HW_ReadData(U8 Unit, void * pBuffer, unsigned NumBytes, unsigned NumBlocks) {
  int r;

  FS_USE_PARA(Unit);
  FS_USE_PARA(pBuffer);
  FS_USE_PARA(NumBytes);
  FS_USE_PARA(NumBlocks);
  r = _WaitForEndOfDMARead();
  if (r) {
    return r;           // Error, could not read data.
  }
  NumBytes *= NumBlocks;
  _ProcessDMARead(pBuffer, NumBytes);
  return r;
}

/*********************************************************************
*
*       _HW_WriteData
*
*  Function description
*    Writes the data to MMC/SD card through the MMC/SD card controller.
*/
static int _HW_WriteData(U8 Unit, const void * pBuffer, unsigned NumBytes, unsigned NumBlocks) {
  int r;

  FS_USE_PARA(Unit);
  FS_USE_PARA(pBuffer);
  FS_USE_PARA(NumBytes);
  FS_USE_PARA(NumBlocks);
  r = _WaitForEndOfDMAWrite();
  return r;
}

/*********************************************************************
*
*       _HW_Delay
*
*  Function description
*    Waits for a certain time given by the parameter.
*/
static void _HW_Delay(int ms) {
  while (ms--) {
    _Delay1ms();
  }
}

/*********************************************************************
*
*       _HW_InitHW
*
*  Function description
*    Initialize the MMC/SD card controller.
*/
static void _HW_Init(U8 Unit) {
  unsigned ms;
  U32      Delay_ns;
  U32      Inst_ns;
  U32      Addr;

  FS_USE_PARA(Unit);
  //
  // Prepare the cache buffer.
  //
  Addr = (U32)_aCacheBuffer;
  Addr = _RoundUpToCacheLine(Addr);
  _pCacheBuffer = (U32 *)Addr;
  //
  // Reset the SDMMC unit.
  //
  RCC_APB2RSTR |= APB2RSTR_SDMMCRST;
  RCC_APB2RSTR &= ~APB2RSTR_SDMMCRST;

  //
  // Enable GPIOs, DMA and SDMMC units.
  //
  RCC_AHB1ENR |= 0
              |  AHB1ENR_DMA2EN
              |  AHB1ENR_PORTBEN
              |  AHB1ENR_PORTDEN
              |  AHB1ENR_PORTGEN
              |  AHB1ENR_PORTIEN
              ;
  RCC_APB2ENR |= APB2ENR_SDMMCEN
              ;
  //
  // D0, D1 signals are controlled by SDMMC.
  //
  GPIOG_MODER &= ~((3uL << (SD_D0_BIT << 1)) |
                   (3uL << (SD_D1_BIT << 1)));
  GPIOG_MODER |= 0
              |  (2uL << (SD_D0_BIT << 1))
              |  (2uL << (SD_D1_BIT << 1))
              ;
  GPIOG_PUPDR &= ~((3uL << (SD_D0_BIT << 1)) |
                   (3uL << (SD_D1_BIT << 1)));
  GPIOG_AFRH  &= ~((0xFuL << ((SD_D0_BIT - 8) << 2)) |
                   (0xFuL << ((SD_D1_BIT - 8) << 2)));
  GPIOG_AFRH  |= 0
              |  (11uL << ((SD_D0_BIT - 8) << 2))
              |  (11uL << ((SD_D1_BIT - 8) << 2))
              ;
  GPIOG_OSPEEDR &= ~((3uL << (SD_D0_BIT << 1)) |
                     (3uL << (SD_D1_BIT << 1)));
  GPIOG_OSPEEDR |= 0                              // High speed ports
                | (3uL << (SD_D0_BIT  << 1))
                | (3uL << (SD_D1_BIT  << 1))
                ;
  //
  // D2 and D3 signals are controlled by SDMMC.
  //
  GPIOB_MODER &= ~((3uL << (SD_D2_BIT << 1)) |
                   (3uL << (SD_D3_BIT << 1)));
  GPIOB_MODER |= 0
              |  (2uL << (SD_D2_BIT << 1))
              |  (2uL << (SD_D3_BIT << 1))
              ;
  GPIOB_PUPDR &= ~((3uL << (SD_D2_BIT << 1)) |
                   (3uL << (SD_D3_BIT << 1)));
  GPIOB_AFRL  &= ~((0xFuL << (SD_D2_BIT << 2)) |
                   (0xFuL << (SD_D3_BIT << 2)));
  GPIOB_AFRL  |= 0
              |  (10uL << (SD_D2_BIT << 2))
              |  (10uL << (SD_D3_BIT << 2))
              ;
  GPIOB_OSPEEDR &= ~((3uL << (SD_D2_BIT << 1))  |
                     (3uL << (SD_D3_BIT << 1)));
  GPIOB_OSPEEDR |= 0                               // High speed ports.
                | (3uL << (SD_D2_BIT << 1))
                | (3uL << (SD_D3_BIT << 1))
                ;
  //
  // The CLK signal is also controlled by SDMMC.
  //
  GPIOD_MODER   &= ~(3uL   << (SD_CLK_BIT << 1));
  GPIOD_MODER   |=  (2uL   << (SD_CLK_BIT << 1));
  GPIOD_PUPDR   &= ~(3uL   << (SD_CLK_BIT << 1));
  GPIOD_AFRL    &= ~(0xFuL << (SD_CLK_BIT << 2));
  GPIOD_AFRL    |=  (11uL  << (SD_CLK_BIT << 2));
  GPIOD_OSPEEDR &= ~(3uL   << (SD_CLK_BIT << 1));
  GPIOD_OSPEEDR |=  (2uL   << (SD_CLK_BIT << 1));
  //
  // The CMD signal is also controlled by SDMMC.
  //
  GPIOD_MODER   &= ~(3uL   << (SD_CMD_BIT << 1));
  GPIOD_MODER   |=  (2uL   << (SD_CMD_BIT << 1));
  GPIOD_PUPDR   &= ~(3uL   << (SD_CMD_BIT << 1));
  GPIOD_AFRL    &= ~(0xFuL << (SD_CMD_BIT << 2));
  GPIOD_AFRL    |=  (11uL  << (SD_CMD_BIT << 2));
  GPIOD_OSPEEDR &= ~(3uL   << (SD_CMD_BIT << 1));
  GPIOD_OSPEEDR |=  (2uL   << (SD_CMD_BIT << 1));
  //
  // The CD signal is controlled by this HW layer.
  //
  GPIOI_MODER   &= ~(3uL   << (SD_CD_BIT << 1));
  GPIOI_PUPDR   &= ~(3uL   << (SD_CD_BIT << 1));
  GPIOI_PUPDR   |=   1uL   << (SD_CD_BIT << 1);           // Enable the pull-up since R76 is not soldered.
  GPIOI_AFRH    &= ~(0xFuL << ((SD_CD_BIT - 8) << 2));
  GPIOI_OSPEEDR &= ~(3uL   << (SD_CD_BIT << 1));
  //
  // SDMMC2 uses the stream 0, channel 11 of DMA2.
  //
  DMA2_S0CR &= ~S0CR_EN;            // Stop the data transfer
  while (DMA2_S0CR & S0CR_EN) {     // Wait for the stream to switch off
    ;
  }
  DMA2_LIFCR  |= 0
              |  LIFCR_CDMEIF0      // Clear any pending interrupts.
              |  LIFCR_CTEIF0
              |  LIFCR_CHTIF0
              |  LIFCR_CTCIF0
              |  LIFCR_CFEIF0
              ;
  //
  // Compute the number of software loops to delay before writing to some SDMMC registers.
  //
  Delay_ns  = (1000000000uL + ((FS_MMC_HW_CM_SDMMC_CLK_KHZ * 3) - 1)) / (FS_MMC_HW_CM_SDMMC_CLK_KHZ * 3);
  Delay_ns += (1000000000uL + ((FS_MMC_HW_CM_PCLK2 * 2) - 1)) / (FS_MMC_HW_CM_PCLK2 * 2);
  Inst_ns   = (1000000000uL + (FS_MMC_HW_CM_HCLK - 1)) / FS_MMC_HW_CM_HCLK;
  _NumLoopsWriteRegDelay = Delay_ns / Inst_ns;
  //
  // Initialize SDMMC
  //
  SDMMC_POWER  = 0;    // Power off
  SDMMC_CLKCR  = 0;    // Disable the clock.
  SDMMC_ARG    = 0;
  SDMMC_CMD    = 0;
  SDMMC_DTIMER = 0;
  SDMMC_DLEN   = 0;
  SDMMC_DCTRL  = 0;
  SDMMC_ICR    = 0x00C007FF;       // Clear interrupts
  SDMMC_MASK   = 0;
  _WriteRegDelayed(&SDMMC_POWER, 3);     // Make sure that SDMMC_POWER is written after the specified delay.
#if FS_MMC_HW_CM_USE_OS
  //
  // Unmask the interrupt sources.
  //
  SDMMC_MASK   = MASK_ALL;
  //
  // Set the priority and enable the interrupts.
  //
  NVIC_SetPriority(DMA2_Stream0_IRQn, DMA_PRIO);
  NVIC_SetPriority(SDMMC2_IRQn, SDMMC_PRIO);
  NVIC_EnableIRQ(DMA2_Stream0_IRQn);
  NVIC_EnableIRQ(SDMMC2_IRQn);
#endif
  //
  // Wait for the power supply of the SD card to become ready.
  //
  ms = FS_MMC_HW_CM_POWER_GOOD_DELAY;
  while (ms--) {
    _Delay1ms();
  }
}

/*********************************************************************
*
*       _HW_GetMaxReadBurst
*
*  Function description
*    Returns the number of block (sectors) that can be read at once
*    with a single READ_MULTIPLE_SECTOR command.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Return value
*    Number of sectors that can be read at once.
*/
static U16 _HW_GetMaxReadBurst(U8 Unit) {
  FS_USE_PARA(Unit);
  return (U16)MAX_NUM_BLOCKS;
}

/*********************************************************************
*
*       _HW_GetMaxWriteBurst
*
*  Function description
*    Returns the number of block (sectors) that can be written at once
*    with a single WRITE_MULTIPLE_SECTOR command.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Return value
*    Number of sectors that can be written at once.
*/
static U16 _HW_GetMaxWriteBurst(U8 Unit) {
  FS_USE_PARA(Unit);
  return (U16)MAX_NUM_BLOCKS;
}

/*********************************************************************
*
*       _HW_SetDataPointer
*
*  Function description
*    Tells the hardware layer where to read data from
*    or write data to. This may be necessary for some controller,
*    before sending the command to the card, eg. programming the DMA.
*    In most cases this function can be left empty.
*
*  Parameters
*    Unit       SD card controller no, in case there are more than one.
*/
static void _HW_SetDataPointer(U8 Unit, const void * p) {
  FS_USE_PARA(Unit);
  _pBuffer = (void *)p; // cast const away as this buffer is used also for storing the data from card
}

/*********************************************************************
*
*       _HW_GetMaxWriteBurstFill
*
*  Function description
*    Returns the number of block (sectors) that can be written at once
*    with a single WRITE_MULTIPLE_SECTOR command. The contents of the
*    sectors is filled with the same 32-bit pattern.
*
*  Parameters
*    Unit     Index of the SD / MMC host controller (0-based).
*
*  Return value
*    Number of sectors that can be written at once.
*/
static U16 _HW_GetMaxWriteBurstFill(U8 Unit) {
  FS_USE_PARA(Unit);
  return (U16)MAX_NUM_BLOCKS;
}

/*********************************************************************
*
*       Public code
*
**********************************************************************
*/

#if FS_MMC_HW_CM_USE_OS

/**********************************************************
*
*       SDMMC2_IRQHandler
*
*   Function description
*     Handles the SDMMC interrupt.
*/
void SDMMC2_IRQHandler(void);
void SDMMC2_IRQHandler(void) {
  U32 Status;

  OS_EnterInterrupt();                        // Inform embOS that interrupt code is running.
  Status       = SDMMC_STA;
  //
  // Save the status to a static variable and check it in the task.
  //
  SDMMC_ICR    = Status & ICR_MASK_STATIC;    // Clear the static flags to prevent further interrupts.
  _StatusSDIO &= ICR_MASK_STATIC;             // Clear the dynamic flags
  _StatusSDIO |= Status;
  FS_X_OS_Signal();                           // Wake up the task.
  OS_LeaveInterrupt();                        // Inform embOS that interrupt code is left.
}

/**********************************************************
*
*       DMA2_Stream0_IRQHandler
*
*   Function description
*     Handles the DMA interrupt.
*/
void DMA2_Stream0_IRQHandler(void);
void DMA2_Stream0_IRQHandler(void) {
  U32 Status;

  OS_EnterInterrupt();          // Inform embOS that interrupt code is running.
  Status      = DMA2_LISR;
  Status     &= 0               // Make sure that we clear only the flags assigned to the DMA stream we use.
             | LIFCR_CFEIF0
             | LIFCR_CDMEIF0
             | LIFCR_CTCIF0
             | LIFCR_CHTIF0
             | LIFCR_CTEIF0
             ;
  DMA2_LIFCR  = Status;         // Clear pending interrupt flags.
  _StatusDMA |= Status;         // Save the status to a static variable and check it in the task.
  FS_X_OS_Signal();             // Wake up the task.
  OS_LeaveInterrupt();          // Inform embOS that interrupt code is left.
}

#endif // FS_MMC_HW_CM_USE_OS

/*********************************************************************
*
*       Global data
*
**********************************************************************
*/
const FS_MMC_HW_TYPE_CM FS_MMC_HW_CM_STM32F769_ST_STM32F769I_DISCO = {
  _HW_Init,
  _HW_Delay,
  _HW_IsPresent,
  _HW_IsWriteProtected,
  _HW_SetMaxSpeed,
  _HW_SetResponseTimeOut,
  _HW_SetReadDataTimeOut,
  _HW_SendCmd,
  _HW_GetResponse,
  _HW_ReadData,
  _HW_WriteData,
  _HW_SetDataPointer,
  _HW_SetHWBlockLen,
  _HW_SetHWNumBlocks,
  _HW_GetMaxReadBurst,
  _HW_GetMaxWriteBurst,
  NULL,
  _HW_GetMaxWriteBurstFill,
  NULL,
  NULL,
  NULL,
  NULL,
  NULL,
  NULL,
  NULL
};

/*************************** End of file ****************************/
